/*
Петър много обича да решава задачи, които затрудняват неговите съученици. Ето една такава задача:
    Дадени са три цели неотрицателни числа a, b, c. Необходимо е да се подредят в някакъв ред и между тях
да се поставят знаците + (за събиране), - (за изваждане) или * (за умножение), така че 
като се пресметне получения аритметичен израз неговата стойност да е възможно най-малката.
Между всяка двойка съседни числа може да има само един знак. Всеки знак може да се използва само един път.
*/

#include<iostream>

using namespace std;

int main(){
    int a,b,c,n;

    cout << "Insert a: "; cin >> a;
    cout << "Insert b: "; cin >> b;
    cout << "insert c: "; cin >> c;

    if (a<b)
    {
        if(a<c&&b<c||a<c&&c<b)
        {
            n = a-b*c;
            cout << n << endl;
        }   
    }
    if (b<c)
    {
        if(b<a&&a<c||b<a&&c<a)
        {
            n = b-a*c;
            cout << n << endl;
        }   
    }
    if (c<a)
    {
        if(c<b&&a<b||c<b&&b<a)
        {
            n = c-b*a;
            cout << n << endl;
        }   
    }
    
}