/* 
    В държавата Бимбинистан се планира изграждането на съвременна телекомуникационна мрежа,
която се основава на използването на кабели с оптични влакна. Поставянето на новите кабели ще
се извършва само по протежение на вече изградените в Бимбинистан шосета.
    Да се състави програма, която въвежда информация за градовете и шосетата на Бимбинистан и
определя по кои шосета да се поставят новите кабели, така че между всеки два града да може да се
предаде информация, като се използва единствено оптичната връзка. Програмата трябва да
постига това като минимизира дължината на изразходвания за целта кабел.
*/

#include <iostream>
#include <vector>
#include <stack>

using namespace std;

void InsertData(){
    
}

int main() {
    vector<int> Graph[1000];
    int n;
    cout << "How many vectors: ";
    cin >> n;
    
}